# -*- coding: utf-8 -*-
TEXT="""Голова Верховної Ради України Андрій Парубій візьме участь у роботі 140-ї Асамблеї Міжпарламентського Союзу

Голова Верховної Ради України Андрій Парубій провів зустріч з Надзвичайним і Повноважним Послом Держави Катар в Україні Гаді Насером Мансуром Халіль Аль-Гаджрі.
Голова Верховної Ради, вітаючи Посла,  відзначив його активну роботу в Україні, а також офіційно підтвердив, що візьме участь у роботі 140-ї Асамблеї Міжпарламентського Союзу, яка відбудеться 6-8 квітня 2019 року у столиці Катару – місті Доха.
 Надзвичайний і Повноважний Посол Держави Катар висловив подяку Голові Верховної Ради України за його рішення брати участь у роботі 140-ї Асамблеї Міжпарламентського Союзу, адже, за словами Посла, це не тільки можливість участі України у надважливому міжнародному парламентському форумі, а й активізація міжпарламентської співпраці між Україною та Катаром. Посол Гаді Насер Мансур Халіль Аль-Гаджрі відзначив, що для Катарської Сторони надзвичайно важливо збільшувати економічну співпрацю між Катаром і Україною, зокрема, у царині експорту газу з Катару до України.
 
Голова Верховної Ради України відзначив, що коли у Парламенті він ставив на голосування питання ратифікації міжнародної Угоди між Катаром і Україною, вона отримала велику підтримку, що свідчить про усвідомлення народними депутатами важливості цієї економічної співпраці.
  Також сторони обговорили питання перспективи підписання Угоди про співпрацю між Верховною Радою України та Консультативною Радою Держави Катар."""

TEXT1="11 12 13, 21 22 23. 11 11, 12, 12,"

import logging.config
logging.config.fileConfig('conf/logging.conf')
logger = logging.getLogger('root')

import whir.counter as whir

message1=whir.message(TEXT)
message1.decompose()

message1.print_all_words()